# Formulae (CLI tools)
brew "eza"
brew "gh"
brew "lazygit"
brew "mas"
brew "mole"
brew "rulesync"
brew "pnpm"
brew "starship"
brew "stow"
brew "thefuck"
brew "zoxide"
brew "zsh-autosuggestions"
brew "zsh-syntax-highlighting"

# Casks (GUI apps)
cask "1password-cli"
cask "alt-tab"
cask "hiddenbar"
cask "claude-code"
cask "finetune"
cask "cleanshot"
cask "discord"
cask "karabiner-elements"
cask "launchos"
cask "notion"
cask "obs"
cask "obsidian"
cask "pearcleaner"
cask "raycast"
cask "screen-studio"
cask "slack"
cask "spotify"
cask "visual-studio-code"
cask "ghostty"
cask "wispr-flow"
cask "zoom"

# Fonts
cask "font-anonymous-pro"
cask "font-geist"
cask "font-geist-mono"
cask "font-meslo-lg-nerd-font"
cask "font-reenie-beanie"

# Mac App Store (requires `mas` CLI and App Store sign-in)
mas "1Password for Safari", id: 1569813296
mas "Final Cut Pro", id: 424389933
mas "Keynote", id: 409183694
mas "Numbers", id: 409203825
mas "Pixelmator Pro", id: 1289583905
mas "Speedtest", id: 1153157709
